---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotCreateFreeFormSetDueToShortBar
source: html/f079b30a-cece-9203-e6c8-b83dd177a21c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotCreateFreeFormSetDueToShortBar Property

Cannot create the rebar set using the current references because at least one bar is below the minimum allowed length. Edit the covers and extents of the set and try the desired layout options again.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateFreeFormSetDueToShortBar { get; }
```